def sort_function(weights, unsorted_housing):
    def multiply_dicts(dict1, dict2):
        result = {}
        for key in dict1:
            if key in dict2:
                result[key] = dict1[key] * dict2[key]
        return result

    # Взвешенная сумма
    def weighted_amount(unsorted_housing, weights):
        weighted_amount_list = {}
        for hid in unsorted_housing:
            summa = 0
            mult_dict = multiply_dicts(unsorted_housing[hid], weights)
            for i in mult_dict:
                summa += mult_dict[i]
            weighted_amount_list[hid] = summa
        return weighted_amount_list

    swa_dict = weighted_amount(unsorted_housing, weights)
    sorted_weighted_amount = dict(sorted(swa_dict.items(), key=lambda item: item[1], reverse=True))
    sorted_housing = []
    for hid in sorted_weighted_amount:
        sorted_housing.append(hid)
    weights_sorted = [key for key in dict(sorted(weights.items(), key=lambda item: item[1], reverse=True))]

    return {"sorted_housing": sorted_housing,
            "weights_sorted": weights_sorted}

# ВСЁ ЧТО НИЖЕ УДАЛИ ПЕРЕД ПРИМЕНЕНИЕМ НА ПРАКТИКЕ!
housing_generated = {
    1: {"Продукты": 4, "Школы": 3, "Детские сады": 2, "Медицина": 2, "Аптеки": 3, "Спорт": 1, "Культура": 3, "Бары": 4},
    2: {"Продукты": 2, "Школы": 2, "Детские сады": 1, "Медицина": 1, "Аптеки": 2, "Спорт": 0, "Культура": 2, "Бары": 2},
    3: {"Продукты": 5, "Школы": 4, "Детские сады": 3, "Медицина": 2, "Аптеки": 4, "Спорт": 2, "Культура": 2, "Бары": 3},
    4: {"Продукты": 3, "Школы": 1, "Детские сады": 1, "Медицина": 1, "Аптеки": 2, "Спорт": 0, "Культура": 4, "Бары": 5},
    5: {"Продукты": 4, "Школы": 2, "Детские сады": 2, "Медицина": 2, "Аптеки": 3, "Спорт": 1, "Культура": 1, "Бары": 2},
    6: {"Продукты": 3, "Школы": 3, "Детские сады": 3, "Медицина": 1, "Аптеки": 3, "Спорт": 2, "Культура": 1, "Бары": 1},
    7: {"Продукты": 5, "Школы": 2, "Детские сады": 1, "Медицина": 2, "Аптеки": 5, "Спорт": 1, "Культура": 4, "Бары": 4},
    8: {"Продукты": 2, "Школы": 4, "Детские сады": 3, "Медицина": 1, "Аптеки": 2, "Спорт": 2, "Культура": 0, "Бары": 1},
    9: {"Продукты": 4, "Школы": 2, "Детские сады": 2, "Медицина": 2, "Аптеки": 4, "Спорт": 3, "Культура": 2, "Бары": 3},
    10: {"Продукты": 1, "Школы": 1, "Детские сады": 0, "Медицина": 1, "Аптеки": 1, "Спорт": 0, "Культура": 1, "Бары": 1},
    11: {"Продукты": 5, "Школы": 3, "Детские сады": 2, "Медицина": 2, "Аптеки": 5, "Спорт": 1, "Культура": 5, "Бары": 5},
    12: {"Продукты": 3, "Школы": 2, "Детские сады": 2, "Медицина": 1, "Аптеки": 3, "Спорт": 2, "Культура": 1, "Бары": 2},
    13: {"Продукты": 2, "Школы": 3, "Детские сады": 2, "Медицина": 1, "Аптеки": 2, "Спорт": 1, "Культура": 1, "Бары": 0},
    14: {"Продукты": 4, "Школы": 1, "Детские сады": 1, "Медицина": 2, "Аптеки": 3, "Спорт": 0, "Культура": 4, "Бары": 4},
    15: {"Продукты": 3, "Школы": 4, "Детские сады": 3, "Медицина": 2, "Аптеки": 3, "Спорт": 3, "Культура": 1, "Бары": 2},
    16: {"Продукты": 5, "Школы": 2, "Детские сады": 2, "Медицина": 2, "Аптеки": 4, "Спорт": 2, "Культура": 3, "Бары": 3},
    17: {"Продукты": 2, "Школы": 2, "Детские сады": 1, "Медицина": 1, "Аптеки": 1, "Спорт": 1, "Культура": 2, "Бары": 1},
    18: {"Продукты": 4, "Школы": 3, "Детские сады": 3, "Медицина": 2, "Аптеки": 4, "Спорт": 2, "Культура": 2, "Бары": 2},
    19: {"Продукты": 3, "Школы": 1, "Детские сады": 1, "Медицина": 1, "Аптеки": 2, "Спорт": 1, "Культура": 3, "Бары": 3},
    20: {"Продукты": 5, "Школы": 4, "Детские сады": 4, "Медицина": 2, "Аптеки": 5, "Спорт": 2, "Культура": 2, "Бары": 1},
}

weights = {
    "Продукты": 0.15,
    "Школы": 0.25,
    "Детские сады": 0.08,
    "Медицина": 0.2,
    "Аптеки": 0.12,
    "Спорт": 0.1,
    "Культура": 0.05,
    "Бары": 0.05
  }

print(sort_function(weights, housing_generated))